In [1]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity='all'
import warnings
warnings.filterwarnings('ignore')

In [2]:
import numpy as np
import pandas as pd
import matplotlib as plt
%matplotlib inline

In [3]:
data = pd.read_csv("titanic.csv")
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
data.shape

(891, 12)

In [5]:
data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [6]:
#check null value
data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [7]:
pd.DataFrame(round((data.isnull().sum() / data.shape[0]) * 100, 3), columns = ['Missing%'])

             Missing%
PassengerId     0.000
Survived        0.000
Pclass          0.000
Name            0.000
Sex             0.000
Age            19.865
SibSp           0.000
Parch           0.000
Ticket          0.000
Fare            0.000
Cabin          77.104
Embarked        0.224

In [8]:
#dropping unnecessary column
data1 = data.drop(['Name', 'Ticket', 'Cabin', 'Sex', 'SibSp', 'Parch', 'Fare', 'Embarked'], axis=1)
data1.head()

   PassengerId  Survived  Pclass   Age
0            1         0       3  22.0
1            2         1       1  38.0
2            3         1       3  26.0
3            4         1       1  35.0
4            5         0       3  35.0

In [9]:
#fill Age null value with mean
data1['Age'] = data1['Age'].fillna(data1['Age'].mean())
data1.head()

   PassengerId  Survived  Pclass   Age
0            1         0       3  22.0
1            2         1       1  38.0
2            3         1       3  26.0
3            4         1       1  35.0
4            5         0       3  35.0

In [10]:
data1.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Age            0
dtype: int64

In [11]:
target = data1['Survived']
target.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [12]:
x = data1.drop('Survived', axis=1)
x.head()

   PassengerId  Pclass   Age
0            1       3  22.0
1            2       1  38.0
2            3       3  26.0
3            4       1  35.0
4            5       3  35.0

In [13]:
from sklearn.model_selection import train_test_split

x_train, x_test, y_train, y_test = train_test_split(data1, target, test_size=0.20, random_state=42)
x_train.shape
x_test.shape
y_train.shape
y_test.shape

(712, 4)

(179, 4)

(712,)

(179,)

In [14]:
from sklearn.linear_model import LogisticRegression
model = LogisticRegression(random_state=42)
model.fit(x_train, y_train)

LogisticRegression(random_state=42)

In [15]:
y_predicted = model.predict(x_test)
y_predicted

array([1, 0, 0, 1, 1, 1, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 1,
       1, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 1, 0, 1, 1, 1, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 1, 0, 1, 1, 1, 0, 1, 1, 0, 0, 0,
       0, 0, 0, 1, 0, 1, 1, 1, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 0, 0, 1, 1,
       0, 0, 1, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 1,
       1, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 1, 1, 0, 0, 0, 1, 1,
       0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 1,
       0, 0, 1, 1, 1, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 0, 0,
       1, 1, 1], dtype=int64)

In [16]:
y_predicted[9]

1

In [17]:
from sklearn.metrics import accuracy_score
print("Model1 accuracy: ", accuracy_score(y_test, y_predicted))

Model1 accuracy:  1.0